Custom Detection Status		
Logsource	count	Status
Okta	5	In prod
Windows	6	In prod
Obsidian	2	In prod
Wiz	2	In prod
GCP Audit	4	In prod
Azure AD	3	In prod
Roadmap		
AWS WAF	1	Inprogress
Fortinet Firewall	5	Inprogress
AWS Cloudtrail	5	Inprogress
Azure activity 	1	Inprogress
		
		
Inprod	22	
Inprogress	12	
Total 	34	



Log_type	Custom usecase Count
CrowdStrike Alerts	1
OBSIDIAN	2
Wiz	2
AZURE_AD	3
GCP_CLOUDAUDIT	4
Okta	5
Windows	6
Grand Total	23
	
Log_type	Curated usecase Count
CrowdStrike Alerts	18
Zscaler	2
Wiz	2
Okta	5
Grand Total	27




"rule BRCM_232_Palo_UDP_Data_Exfil_To_External {

meta:
    name = ""BRCM_232_Palo_UDP_Data_Exfil_To_External""
    author = ""Deloitte""
    description = ""Detects potential UDP data exfiltration to external non-owned, non-cloud destinations with exclusions, where large volumes of UDP traffic (over 50GB within a 12-hour period) are sent from our environment to external IP addresses, using Palo Alto firewall logs as the data source.""
    severity = ""Medium""
    log_dependencies = ""PAN_FIREWALL""

events:

    $e.metadata.log_type = ""PAN_FIREWALL"" AND
    $e.network.ip_protocol = ""UDP"" AND
    NOT ($e.target.ip in cidr %Private_IP_Subnets) AND
    NOT ($e.target.ip in cidr %Broadcom_Owned_Infrastructure_All) AND
    $e.observer.hostname = /pfw-prod/ nocase AND
    $e.network.sent_bytes > 1 AND

    // Exclusions
    $e.target.ip_geo_artifact.network.carrier_name != ""avago technologies u.s. inc."" nocase AND
    $e.target.ip_geo_artifact.network.organization_name != ""avago technologies u.s. inc."" nocase AND
    $e.target.ip_geo_artifact.network.organization_name != /google|amazon/ nocase AND

    $e.principal.ip = $source_ip AND
    $e.target.ip = $dest_ip

match:
    $source_ip, $dest_ip over 12h

outcome:
    $total_network_bytes = sum($e.network.sent_bytes)
    $org = array_distinct($e.target.ip_geo_artifact.network.organization_name)

condition:
    $e AND $total_network_bytes > 53687091200 // 50GB
}
"





Windows Event Logs​

Linux Audit/Auth Logs​

CrowdStrike Alerts(via Feeds)​

Obsidian Security Logs(via Feeds)​

Wiz(via Feeds)​

Okta​

Tenable​

Infoblox (DNS/DHCP)​

Microsoft Entra ID (Azure AD)​

CyberArk Privilege Cloud​

Arista Switches​

Cisco ISE (TACACS)​

Firewalls (Fortigate/Fortimanager)​

Google VPC Flow Logs​

Google DNS Logs​

Google Audit Logs​

Zscaler ZIA​

Zscaler ZPA​

----------------------------------
SailPoint​

Azure Activity Logs​

ServiceNow​

AWS CloudTrail​

Azure Key Vault Logging​

AWS GuardDuty Logs​

AWS Config​

AWS VPC Flow Logs​

Azure NSG Flow Logs​

DigicertONE PKI Infrastructure​

AWS WAF​

Github​

Workday​

Checkmarx​

Concur​

Windows AD Logs​

MS Defender for Identity​

Microsoft Defender for Endpoint​

O365​

Salesforce (Automotive Insights)​

Selector AI​

-------------------------------------------

fortinet_firewall_high_volume_external_data_exfiltration
fortinet_firewall_sucessfull_external_rdp_connection
crowdstrike_automated_lead_alerts
wiz_security_finding
wiz_detection_finding
GCP_firewall_rule_deleted_then_instance_created
GCP_excessive_iam_policy_changes
GCP_Mass_Object_Deletion
GCP_Compute_Restart_after_ConfigChange
Azure_AD_login_blocked_by_conditional_access
Azure_AD_App_Registration_with_Admin_Consent
Azure_AD_Brute_Force_Followed_By_Successful_Login
windows_event_log_cleared
windows_remoteinteractive_login_failures
windows_scheduled_task_created_with_rundll32_command
windows_user_account_created_added_to_group_and_deleted_within_short_time
windows_batch_file_created_in_temp_folder
windows_event_log_access_tampering_via_registry
okta_threatinsight_targeted_brute_force_attack_002
obsidian_low_and_unknown_severity_alerts
obsidian_medium_high_and_critical_alerts
okta_multiple_policy_addition_deletion_or_update
okta_high_number_password_change_or_reset
okta_user_account_lockouts
okta_successful_high_risk_us



Log Category	Log Source	 Overall Logging Status
Artifactory	JFrog	To be done
	JFrog Total	
Artifactory Total		
Cloud	AWS CloudTrail	Completed
	AWS CloudTrail Total	
	AWS Config	Completed
	AWS Config Total	
	AWS GuardDuty logs	Completed
	AWS GuardDuty logs Total	
	AWS VPC Flow Logs	Completed
	AWS VPC Flow Logs Total	
	AWS WAF	Completed
	AWS WAF Total	
	Azure Activity logs	Completed
	Azure Activity logs Total	
	Azure Blob	Completed
	Azure Blob Total	
	Azure Event Hub	(blank)
	Azure Event Hub Total	
	Azure Key Vault Logging	Completed
	Azure Key Vault Logging Total	
	Azure NSG Flow Logs	Completed
	Azure NSG Flow Logs Total	
	Google Audit logs	Completed
	Google Audit logs Total	
	Google DNS Logs	Completed
	Google DNS Logs Total	
	Google VPC Flow Logs	Completed
	Google VPC Flow Logs Total	
Cloud Total		
Endpoint	CrowdStrike Alerts	Completed
	CrowdStrike Alerts Total	
	Linux Audit/Auth logs	Completed
	Linux Audit/Auth logs Total	
	Microsoft Defender for Endpoint	To be done
	Microsoft Defender for Endpoint Total	
	Windows Event logs	Completed
	Windows Event logs Total	
Endpoint Total		
Identity	Cyberark Privilege Cloud	Completed
	Cyberark Privilege Cloud Total	
	Microsoft Entra ID (Azure AD)	Completed
	Microsoft Entra ID (Azure AD) Total	
	MS Defender for Identity	To be done
	MS Defender for Identity Total	
	Obsidian Security logs	Completed
	Obsidian Security logs Total	
	Okta	Completed
	Okta Total	
	SailPoint	Completed
	SailPoint Total	
	Windows AD logs	In Progress
	Windows AD logs Total	
Identity Total		
InfoSec	Checkmarx	Completed
	Checkmarx Total	
	DigicertONE PKI Insfrastructure	Completed
	DigicertONE PKI Insfrastructure Total	
	Tenable	Completed
	Tenable Total	
	Zscaler ZIA	Completed
	Zscaler ZIA Total	
InfoSec Total		
Network	Arista Switches	Completed
	Arista Switches Total	
	Cisco ISE (TACACS)	Completed
	Cisco ISE (TACACS) Total	
	Firewalls (Fortigate/Fortimanager)	Completed
	Firewalls (Fortigate/Fortimanager) Total	
	Guardicore	(blank)
	Guardicore Total	
	Infoblox (DNS/DHCP)	Completed
	Infoblox (DNS/DHCP) Total	
	Zscaler ZPA	Completed
	Zscaler ZPA Total	
Network Total		
SaaS	Concur	To be done
	Concur Total	
	Github	Completed
	Github Total	
	O365	Completed
	O365 Total	
	Salesforce (Automotive Insights)	To be done
	Salesforce (Automotive Insights) Total	
	ServiceNow	Completed
	ServiceNow Total	
	Wiz	Completed
	Wiz Total	
	Workday	To be done
	Workday Total	
SaaS Total		
(blank)	(blank)	(blank)
	(blank) Total	
(blank) Total		
Grand Total		
