Custom Detection Status		
Logsource	count	Status
Okta	5	In prod
Windows	6	In prod
Obsidian	2	In prod
Wiz	2	In prod
GCP Audit	4	In prod
Azure AD	3	In prod
Roadmap		
AWS WAF	1	Inprogress
Fortinet Firewall	5	Inprogress
AWS Cloudtrail	5	Inprogress
Azure activity 	1	Inprogress
		
		
Inprod	22	
Inprogress	12	
Total 	34	



Log_type	Custom usecase Count
CrowdStrike Alerts	1
OBSIDIAN	2
Wiz	2
AZURE_AD	3
GCP_CLOUDAUDIT	4
Okta	5
Windows	6
Grand Total	23
	
Log_type	Curated usecase Count
CrowdStrike Alerts	18
Zscaler	2
Wiz	2
Okta	5
Grand Total	27




"rule BRCM_232_Palo_UDP_Data_Exfil_To_External {

meta:
    name = ""BRCM_232_Palo_UDP_Data_Exfil_To_External""
    author = ""Deloitte""
    description = ""Detects potential UDP data exfiltration to external non-owned, non-cloud destinations with exclusions, where large volumes of UDP traffic (over 50GB within a 12-hour period) are sent from our environment to external IP addresses, using Palo Alto firewall logs as the data source.""
    severity = ""Medium""
    log_dependencies = ""PAN_FIREWALL""

events:

    $e.metadata.log_type = ""PAN_FIREWALL"" AND
    $e.network.ip_protocol = ""UDP"" AND
    NOT ($e.target.ip in cidr %Private_IP_Subnets) AND
    NOT ($e.target.ip in cidr %Broadcom_Owned_Infrastructure_All) AND
    $e.observer.hostname = /pfw-prod/ nocase AND
    $e.network.sent_bytes > 1 AND

    // Exclusions
    $e.target.ip_geo_artifact.network.carrier_name != ""avago technologies u.s. inc."" nocase AND
    $e.target.ip_geo_artifact.network.organization_name != ""avago technologies u.s. inc."" nocase AND
    $e.target.ip_geo_artifact.network.organization_name != /google|amazon/ nocase AND

    $e.principal.ip = $source_ip AND
    $e.target.ip = $dest_ip

match:
    $source_ip, $dest_ip over 12h

outcome:
    $total_network_bytes = sum($e.network.sent_bytes)
    $org = array_distinct($e.target.ip_geo_artifact.network.organization_name)

condition:
    $e AND $total_network_bytes > 53687091200 // 50GB
}
"





Windows Event Logs​

Linux Audit/Auth Logs​

CrowdStrike Alerts(via Feeds)​

Obsidian Security Logs(via Feeds)​

Wiz(via Feeds)​

Okta​

Tenable​

Infoblox (DNS/DHCP)​

Microsoft Entra ID (Azure AD)​

CyberArk Privilege Cloud​

Arista Switches​

Cisco ISE (TACACS)​

Firewalls (Fortigate/Fortimanager)​

Google VPC Flow Logs​

Google DNS Logs​

Google Audit Logs​

Zscaler ZIA​

Zscaler ZPA​

----------------------------------
SailPoint​

Azure Activity Logs​

ServiceNow​

AWS CloudTrail​

Azure Key Vault Logging​

AWS GuardDuty Logs​

AWS Config​

AWS VPC Flow Logs​

Azure NSG Flow Logs​

DigicertONE PKI Infrastructure​

AWS WAF​

Github​

Workday​

Checkmarx​

Concur​

Windows AD Logs​

MS Defender for Identity​

Microsoft Defender for Endpoint​

O365​

Salesforce (Automotive Insights)​

Selector AI​

-------------------------------------------

fortinet_firewall_high_volume_external_data_exfiltration
fortinet_firewall_sucessfull_external_rdp_connection
crowdstrike_automated_lead_alerts
wiz_security_finding
wiz_detection_finding
GCP_firewall_rule_deleted_then_instance_created
GCP_excessive_iam_policy_changes
GCP_Mass_Object_Deletion
GCP_Compute_Restart_after_ConfigChange
Azure_AD_login_blocked_by_conditional_access
Azure_AD_App_Registration_with_Admin_Consent
Azure_AD_Brute_Force_Followed_By_Successful_Login
windows_event_log_cleared
windows_remoteinteractive_login_failures
windows_scheduled_task_created_with_rundll32_command
windows_user_account_created_added_to_group_and_deleted_within_short_time
windows_batch_file_created_in_temp_folder
windows_event_log_access_tampering_via_registry
okta_threatinsight_targeted_brute_force_attack_002
obsidian_low_and_unknown_severity_alerts
obsidian_medium_high_and_critical_alerts
okta_multiple_policy_addition_deletion_or_update
okta_high_number_password_change_or_reset
okta_user_account_lockouts
okta_successful_high_risk_us
