rule MXDR_batch_file_created_in_windows_temp_folder {
  

  meta:
    author = "Varun Murthy"
    date_of_creation = "15/02/2024"
    date_of_finalization = "21/2/2024"
	description = "Detects batch files being created in windows temp folder.Dumping files into temp folder by itself raises security concerns, if these are batch files the chances of them being malicious might be really high. Since everyone has write access to temp folder, an attacker could abuse this behavior to run arbitrary code on the victim’s system."
    severity = "medium"
    category = "Endpoint" 
    mitre_tactic = " Persistence, Privilege Escalation, Defense Evasion"
    mitre_tactic_id = "TA0003, TA0004, TA0005"
    mitre_technique = "Hijack Execution Flow: Executable Installer File Permissions Weakness"
    mitre_technique_id = "T1574.005"
	rule_source = "Threat Detection R&D"
    rule_validation = "20/02/2024"
    rule_validated_by = "Varun Murthy"
	rule_validation_notes = "not detected by CrowdStrike"
	lists = "none"
    known_false_positives = "none"
 

  events:
    $e.metadata.event_type = "FILE_CREATION" 
    $e.target.file.full_path = /\\windows\\temp\\.*\.bat$/ nocase 
    ($e.principal.process.file.full_path = "System" nocase or $e.principal.process.file.full_path = /explorer\.exe/ nocase)

    not $e.target.file.full_path in regex %FILE_WHITELIST 

    outcome:
        $command = array_distinct($e.target.process.command_line )
        $host = array_distinct($e.principal.hostname )
        $prinicpal_file_path = array_distinct($e.principal.process.file.full_path)
        $target_file_path = array_distinct($e.target.file.full_path )

  
  condition:
    $e
}



rule MXDR_windows_event_log_access_tampering_via_registry 
{
 meta:
    author = "Rohan Nema"
    date_of_creation = "2/09/2025"
    date_of_finalization = "2/13/2025"
    description = "Detects changes to the Windows EventLog channel permission values. It focuses on changes to the Security Descriptor Definition Language (SDDL) string, as modifications to these values can restrict access to specific users or groups, potentially aiding in defense evasion by controlling who can view or modify a event log channel. Upon execution, the user shouldn't be able to access the event log channel via the event viewer or via utilities such as Get-EventLog or wevtutil"
    severity = "Medium"
    category = "Endpoint" 
    mitre_tactic = "Persistence, Privilege Escalation"
    mitre_tactic_id = "TA0003, TA0004"
    mitre_technique = "Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder"
    mitre_technique_id = "T1574.001"
	rule_source = "Threat Detection R&D"
    rule_validation = "2/13/2025"
    rule_validated_by = "Rohan Nema"
    lists = "none"
    known_false_positives = "none"
    

  events:
   (
    $event.metadata.event_type = "REGISTRY_MODIFICATION" 
    and (
      (
        re.regex($event.target.registry.registry_key, `\\SYSTEM\\controlset\\Services\\EventLog\\System`) nocase and 
        (re.regex($event.target.registry.registry_key, `\\CustomSD$`) nocase or $event.target.registry.registry_value_name = "CustomSD")
      )
      or (
        (
          re.regex($event.target.registry.registry_key, `\\Policies\\Microsoft\\Windows\\EventLog\\Setup`) nocase or 
          re.regex($event.target.registry.registry_key, `\\Microsoft\\Windows\\CurrentVersion\\WINEVT\\Channels`) nocase
        )
        and 
        (re.regex($event.target.registry.registry_key, `\\ChannelAccess$`) nocase or $event.target.registry.registry_value_name = "ChannelAccess")
      )
    )
    and (
      re.regex($event.target.registry.registry_value_data, `D:\(D;`) nocase
      or (
        re.regex($event.target.registry.registry_value_data, `D:\(`) nocase and 
        re.regex($event.target.registry.registry_value_data, `\)\(D;`) nocase
      )
    )
  )

  outcome:
        $key_asset = array_distinct($event.principal.hostname )
        $principal_command_line = array_distinct($event.principal.process.command_line)
        $target_command_line = array_distinct($event.target.process.command_line)
        $principal_file_path = array_distinct($event.principal.process.file.full_path)
        $target_file_path = array_distinct($event.target.process.file.full_path)
        $target_user_email_address = array_distinct($event.target.user.email_addresses)
        $target_registry_key = array_distinct($event.target.registry.registry_key)
        $target_registry_value_name = array_distinct($event.target.registry.registry_value_name)
        $target_registry_value_data = array_distinct($event.target.registry.registry_value_data)
        $log_type = array_distinct($event.metadata.log_type)


  condition:
    $event
}

//ref:- https://www.atomicredteam.io/atomic-red-team/atomics/T1562.002#atomic-test-8---modify-event-log-channel-access-permissions-via-registry---powershell
